In [1]:
import pandas as pd
import numpy as np
from scipy import stats
import scipy.stats as st

In [2]:
from google.colab import drive
drive.mount('/content/drive')

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

#Hypothesis Testing

In [3]:
df = pd.read_csv('/content/drive/MyDrive/Bootcamp/marketing_campaign.csv', sep="\t")
df

,ID,Year_Birth,Education,Marital_Status,Income,Kidhome,Teenhome,Dt_Customer,Recency,MntWines,...,NumWebVisitsMonth,AcceptedCmp3,AcceptedCmp4,AcceptedCmp5,AcceptedCmp1,AcceptedCmp2,Complain,Z_CostContact,Z_Revenue,Response
0,5524,1957,Graduation,Single,58138.0,0,0,04-09-2012,58,635,...,7,0,0,0,0,0,0,3,11,1
1,2174,1954,Graduation,Single,46344.0,1,1,08-03-2014,38,11,...,5,0,0,0,0,0,0,3,11,0
2,4141,1965,Graduation,Together,71613.0,0,0,21-08-2013,26,426,...,4,0,0,0,0,0,0,3,11,0
3,6182,1984,Graduation,Together,26646.0,1,0,10-02-2014,26,11,...,6,0,0,0,0,0,0,3,11,0
4,5324,1981,PhD,Married,58293.0,1,0,19-01-2014,94,173,...,5,0,0,0,0,0,0,3,11,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2235,10870,1967,Graduation,Married,61223.0,0,1,13-06-2013,46,709,...,5,0,0,0,0,0,0,3,11,0
2236,4001,1946,PhD,Together,64014.0,2,1,10-06-2014,56,406,...,7,0,0,0,1,0,0,3,11,0
2237,7270,1981,Graduation,Divorced,56981.0,0,0,25-01-2014,91,908,...,6,0,1,0,0,0,0,3,11,0
2238,8235,1956,Master,Together,69245.0,0,1,24-01-2014,8,428,...,3,0,0,0,0,0,0,3,11,0
2239,9405,1954,PhD,Married,52869.0,1,1,15-10-2012,40,84,...,7,0,0,0,0,0,0,3,11,1

In [4]:
ndf = df.fillna(0)

In [5]:
ndf['Education'].value_counts()

Graduation    1127
PhD            486
Master         370
2n Cycle       203
Basic           54
Name: Education, dtype: int64

Apakah Education berpengaruh terhadap income??

H0 : Education tidak berpengaruh terhadap income <br>
H1 : Education berpengaruh terhadap income

In [6]:
Graduation = ndf[ndf['Education']=='Graduation']
PhD = ndf[ndf['Education']=='PhD']
Master = ndf[ndf['Education']=='Master']
n_Cycle = ndf[ndf['Education']=='2n Cycle']
Basic = ndf[ndf['Education']=='Basic']

In [7]:
anova_test = st.f_oneway(Graduation['Income'],PhD['Income'],Master['Income'],n_Cycle['Income'],Basic['Income'])

In [8]:
anova_test.pvalue

3.6556673589480544e-21

In [10]:
if anova_test.pvalue>0.05:
    print('Education tidak berpengaruh terhadap income')
else:
    print('Education berpengaruh terhadap income')

Education berpengaruh terhadap income

#Ukuran Pemusatan dan Ukuran Penyebaran Data

In [11]:
#Mean Income per Education

ndf.groupby(['Education'])['Income'].mean()

Education
2n Cycle      46929.251232
Basic         20306.259259
Graduation    52205.800355
Master        52202.432432
PhD           55567.687243
Name: Income, dtype: float64

In [12]:
#Mean Income Keseluruhan

np.mean(ndf['Income'])

51687.459375

In [13]:
#Median Income per Education

ndf.groupby(['Education'])['Income'].median()

Education
2n Cycle      46772.0
Basic         20744.0
Graduation    51651.0
Master        50183.5
PhD           55005.0
Name: Income, dtype: float64

In [14]:
#Median Income Keseluruhan

np.median(ndf['Income'])

51075.0

In [15]:
#Mode Education

val, count = np.unique(ndf['Education'], return_counts=True) 
index = np.argmax(count) 
print("mode :", val[index])

mode : Graduation

In [16]:
#Mode Income

val, count = np.unique(ndf['Income'], return_counts=True)
index = np.argmax(count) 
print("mode :", val[index])

mode : 0.0

In [17]:
#Variance Income

np.var(ndf['Income'])

655545650.0260329

In [18]:
#Standar Deviation Income

np.std(ndf['Income'])

25603.625720316115

In [19]:
#Range Income

range = max(ndf['Income']) - min(ndf['Income'])
range

666666.0

In [20]:
#Quartile Income

q1 = np.quantile(ndf['Income'], 0.25)
q2 = np.quantile(ndf['Income'], 0.5)
q3 = np.quantile(ndf['Income'], 0.75)

q1, q2, q3

(34722.0, 51075.0, 68289.75)

In [21]:
#Pengukuran Income dengan menggunakan .describe

ndf['Income'].describe()

count      2240.000000
mean      51687.459375
std       25609.342730
min           0.000000
25%       34722.000000
50%       51075.000000
75%       68289.750000
max      666666.000000
Name: Income, dtype: float64

In [22]:
#Pengukuran Education dengan menggunakan .describe

ndf['Education'].describe(exclude=np.number)

count           2240
unique             5
top       Graduation
freq            1127
Name: Education, dtype: object